# dates and strings - what you need to know

Working with datetime format
Standardizing input 
Using string functions

In [1]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
%pwd

'/Users/andreatognoli/Documents/first_week'

### to work with dates, we need a data set that contains dates

In [7]:
file = pd.read_csv('web_data.csv')
file.dtypes

web_id           int64
client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [8]:
#use head to review the file 
file.head()
# date_time had date and hour all together
#date time is object type and we have to convert it
#parse with /

,web_id,client_id,visitor_id,visit_id,process_step,date_time
0,0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,4/17/17 15:27
1,1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,4/17/17 15:26
2,2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,4/17/17 15:19
3,3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,4/17/17 15:19
4,4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,4/17/17 15:18

In [9]:
#convert the date_time column to be read as a datetime data type 
file['date_time'] = pd.to_datetime(file['date_time'], errors='coerce') # coerce deal with the errors and let the code run even 
#with errors, for instance if some of the obs contain a charater ot missing values

In [16]:
#use head() to review the first 12 rows of the file
file.head(12)

,web_id,client_id,visitor_id,visit_id,process_step,date_time
0,0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:00
1,1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:00
2,2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:00
3,3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:00
4,4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:00
5,5,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:17:00
6,6,9988021,580560515_7732621733,781255054_21935453173_531117,step_1,2017-04-17 15:17:00
7,7,9988021,580560515_7732621733,781255054_21935453173_531117,start,2017-04-17 15:16:00
8,8,8320017,39393514_33118319366,960651974_70596002104_312201,confirm,2017-04-05 13:10:00
9,9,8320017,39393514_33118319366,960651974_70596002104_312201,step_3,2017-04-05 13:09:00
10,10,8320017,39393514_33118319366,960651974_70596002104_312201,step_2,2017-04-05 13:08:00
11,11,8320017,39393514_33118319366,960651974_70596002104_312201,step_1,2017-04-05 13:08:00

In [17]:
#use dtypes to see the new date time data type 
file.dtypes

web_id                   int64
client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
dtype: object

In [19]:
#use the day month year and index to check the month and day of the first row eg file['date_time'][0].year
file['date_time'][0].year

2017

In [25]:
file['date_time'][0].month

4

In [24]:
file['date_time'][0].day

17

In [26]:
#pull out the time 
file['date_time'][0].time()

datetime.time(15, 27)

In [30]:
#reformat the date - example 1
file['date_time'][0].strftime(format='%d-%m-%Y')

'17-04-2017'

In [28]:
#reformat the date - example 2
file['date_time'][0].strftime(format="%A %d. %B %Y")

'Monday 17. April 2017'

In [32]:
#create a filtered data frame by a particular date # create a df with all the same dates
Apr_5 = file[file['date_time'] == '2017-04-05']

In [33]:
Apr_5.head()

,web_id,client_id,visitor_id,visit_id,process_step,date_time
15403,15403,9088919,594492611_13177416992,373345047_76916836421_363244,confirm,2017-04-05
97905,97905,5171878,88910480_73022518291,390443893_82608504306_269,start,2017-04-05
97906,97906,5171878,88910480_73022518291,390443893_82608504306_269,start,2017-04-05
292632,292632,1839329,674533465_6091016367,167956133_23637791586_417756,confirm,2017-04-05
296638,296638,8367317,541357206_53611607620,445730306_83279848654_782988,step_3,2017-04-05

In [36]:
# for working with indexing date is better to create new cols with month, day, ...
#add a month column 
file['Month'] = pd.DatetimeIndex(file['date_time']).month

In [37]:
#add a day column 
file['Day'] = pd.DatetimeIndex(file['date_time']).day

In [38]:
#Review the data frame with head() 
file.head()

,web_id,client_id,visitor_id,visit_id,process_step,date_time,Month,Day
0,0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:00,4,17
1,1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:00,4,17
2,2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:00,4,17
3,3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:00,4,17
4,4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:00,4,17

In [46]:
#filter by a particular day 
file.query('Day==5')

,web_id,client_id,visitor_id,visit_id,process_step,date_time,Month,Day
8,8,8320017,39393514_33118319366,960651974_70596002104_312201,confirm,2017-04-05 13:10:00,4,5
9,9,8320017,39393514_33118319366,960651974_70596002104_312201,step_3,2017-04-05 13:09:00,4,5
10,10,8320017,39393514_33118319366,960651974_70596002104_312201,step_2,2017-04-05 13:08:00,4,5
11,11,8320017,39393514_33118319366,960651974_70596002104_312201,step_1,2017-04-05 13:08:00,4,5
12,12,8320017,39393514_33118319366,960651974_70596002104_312201,start,2017-04-05 13:08:00,4,5
...,...,...,...,...,...,...,...,...
343106,343106,9722009,315897436_78057862622,361383806_64671399344_414117,confirm,2017-04-05 16:45:00,4,5
343107,343107,9722009,315897436_78057862622,361383806_64671399344_414117,step_3,2017-04-05 16:43:00,4,5
343108,343108,9722009,315897436_78057862622,361383806_64671399344_414117,step_2,2017-04-05 16:41:00,4,5
343109,343109,9722009,315897436_78057862622,361383806_64671399344_414117,step_1,2017-04-05 16:40:00,4,5
343110,343110,9722009,315897436_78057862622,361383806_64671399344_414117,start,2017-04-05 16:40:00,4,5

In [49]:
file['Month'].value_counts() #counts freq of months

4    260105
3     83036
Name: Month, dtype: int64

In [50]:
file['Month'].unique() #

array([4, 3])

In [51]:
#challenge - filter the df for saturdays
file.query('Day==5')  # Sat is 5 because Monday is 0

,web_id,client_id,visitor_id,visit_id,process_step,date_time,Month,Day
8,8,8320017,39393514_33118319366,960651974_70596002104_312201,confirm,2017-04-05 13:10:00,4,5
9,9,8320017,39393514_33118319366,960651974_70596002104_312201,step_3,2017-04-05 13:09:00,4,5
10,10,8320017,39393514_33118319366,960651974_70596002104_312201,step_2,2017-04-05 13:08:00,4,5
11,11,8320017,39393514_33118319366,960651974_70596002104_312201,step_1,2017-04-05 13:08:00,4,5
12,12,8320017,39393514_33118319366,960651974_70596002104_312201,start,2017-04-05 13:08:00,4,5
...,...,...,...,...,...,...,...,...
343106,343106,9722009,315897436_78057862622,361383806_64671399344_414117,confirm,2017-04-05 16:45:00,4,5
343107,343107,9722009,315897436_78057862622,361383806_64671399344_414117,step_3,2017-04-05 16:43:00,4,5
343108,343108,9722009,315897436_78057862622,361383806_64671399344_414117,step_2,2017-04-05 16:41:00,4,5
343109,343109,9722009,315897436_78057862622,361383806_64671399344_414117,step_1,2017-04-05 16:40:00,4,5
343110,343110,9722009,315897436_78057862622,361383806_64671399344_414117,start,2017-04-05 16:40:00,4,5

In [52]:
file.loc[file['date_time'].dt.weekday == 5]

,web_id,client_id,visitor_id,visit_id,process_step,date_time,Month,Day
354,354,2709011,664541274_97144910167,235162568_43115336410_822881,start,2017-04-08 12:33:00,4,8
355,355,9900469,210215964_20090640456,3461145_4721576513_877614,start,2017-04-01 19:02:00,4,1
357,357,6229916,483835308_26502657270,230630559_77569449276_549196,confirm,2017-04-01 16:29:00,4,1
358,358,6229916,483835308_26502657270,230630559_77569449276_549196,confirm,2017-04-01 16:27:00,4,1
366,366,4773291,587236617_20429853618,504295674_94485333270_228899,start,2017-04-08 04:49:00,4,8
...,...,...,...,...,...,...,...,...
342864,342864,6820024,415995398_21642161061,917003829_36953216287_21421,start,2017-03-18 12:27:00,3,18
342865,342865,6820024,415995398_21642161061,917003829_36953216287_21421,step_1,2017-03-18 12:26:00,3,18
342866,342866,6820024,415995398_21642161061,917003829_36953216287_21421,start,2017-03-18 12:25:00,3,18
342923,342923,127202,575836768_6553168853,786607636_58917493275_576382,start,2017-04-08 12:36:00,4,8
342924,342924,127202,575836768_6553168853,786607636_58917493275_576382,start,2017-04-08 12:35:00,4,8

### Relative time

In [53]:
import time
from datetime import date
today = date.today()
today

datetime.date(2021, 3, 25)

In [54]:
#your local time 
time.localtime(time.time())

time.struct_time(tm_year=2021, tm_mon=3, tm_mday=25, tm_hour=10, tm_min=10, tm_sec=18, tm_wday=3, tm_yday=84, tm_isdst=0)

In [55]:
#current time in london
time.gmtime(time.time())

time.struct_time(tm_year=2021, tm_mon=3, tm_mday=25, tm_hour=9, tm_min=10, tm_sec=31, tm_wday=3, tm_yday=84, tm_isdst=0)

https://docs.python.org/3/library/time.html

Directive and their Meaning

%a Locale’s abbreviated weekday name.
%A Locale’s full weekday name.
%b Locale’s abbreviated month name.
%B Locale’s full month name.
%c Locale’s appropriate date and time representation.
%d Day of the month as a decimal number [01,31].
%H Hour (24-hour clock) as a decimal number [00,23].
%I Hour (12-hour clock) as a decimal number [01,12].
%j Day of the year as a decimal number [001,366].
%m Month as a decimal number [01,12].
%M Minute as a decimal number [00,59].
%p Locale’s equivalent of either AM or PM.
%S Second as a decimal number [00,61].
%U Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.
%w Weekday as a decimal number [0(Sunday),6].
%W Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0
%x Locale’s appropriate date representation.
%X Locale’s appropriate time representation.
%y Year without century as a decimal number [00,99].
%Y Year with century as a decimal number.
%z Time zone offset indicating a positive or negative time difference from UTC/GMT of the form +HHMM or -HHMM, where H represents decimal hour digits and M represents decimal minute digits [-23:59, +23:59].
%Z Time zone name (no characters if no time zone exists).
%% A literal '%' character.

# String functions

In [ ]:

# https://docs.python.org/2.5/lib/string-methods.html

In [56]:
string = " I am learning  data  analysis at Ironhack  . It is  the BEST! "

In [57]:
string.lower()

' i am learning  data  analysis at ironhack  . it is  the best! '

In [58]:
string.upper()

' I AM LEARNING  DATA  ANALYSIS AT IRONHACK  . IT IS  THE BEST! '

In [59]:
#we can identify numbers in strings 
'34'.isdigit() # hint: this does not work with decimal numbers

True

In [60]:
subjects='data science, coding  , python, visualisation '

In [61]:
#using a basic split around the comma 
subjects.split(', ')

['data science', 'coding  ', 'python', 'visualisation ']

In [62]:
#combine split on column with trim of whitespace

pieces = [x.strip() for x in subjects.split(',')]
pieces

['data science', 'coding', 'python', 'visualisation']

In [63]:
#keyword search 
'data science' in subjects

True

In [64]:
str='data scientists too'

In [65]:
#isolate part of a string using index 
str[5:-4]

'scientists'

In [66]:
#replace
'its hard playing with strings'.replace('hard','brilliant')

'its brilliant playing with strings'

In [67]:
#use left strip to remove characters 
text="..ssshhh..,,,,aaaahsdata"
x = text.lstrip(".,ash")
x

'data'

In [71]:
#use left strip to remove leading white space #the count stop whenever it finds the character we have choosed
text2="     whoamiwho?"
y= text2.lstrip(".,w")
y

'     whoamiwho?'

In [69]:
#substring count 
my_string = "How many fruits do you have in your fruit basket?"
my_string.count("fruit")

2